package lv.javaguru.java1.student_dmitry_voronin.lesson_1.lesson_2.level_1.level_4;

public class Task_1 {
    public static void main(String[] args) {
        System.out.println("text");
        System.out.print("texte ");
        System.out.print("text 2");

    }
}
//Команда System.out.println("text"); выводит указанный "text"
//на консоль, и переводит курсор на новую строку.
//
//Для того, что бы выводить текст на консоль без перевода курсора на
//новую строку можно воспользоваться командой
//    System.out.print("text");
//эта команда распечатает текст на консоль и оставит курсор в той же строке.
//
//Напишите программу, которая демонстрирует использование команды
//    System.out.print("text");